{"format": "graph-model", "generatedBy": "2.17.0", "convertedBy": "TensorFlow.js Converter v4.21.0", "signature": {"inputs": {"inputs": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "100"}, {"size": "13"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/strided_slice_3/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_8_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_9_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "13"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "100"}, {"size": "13"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/Shape", "op": "Shape", "input": ["inputs"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/transpose", "op": "Transpose", "input": ["inputs", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/Shape", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/strided_slice/stack", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/strided_slice/stack_1", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/transpose", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/strided_slice", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/zeros/packed", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/LoopControlInputs/_21", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/zeros", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/TensorArrayV2_1"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/enter/_13", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/Max", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/LoopControlInputs/_21"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81XzEvc2ltcGxlX3Jubl80XzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/enter/_17", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/LoopControlInputs/_21"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81XzEvc2ltcGxlX3Jubl80XzEvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/enter/_15", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/TensorArrayV2_1", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/LoopControlInputs/_21"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81XzEvc2ltcGxlX3Jubl80XzEvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/enter/_12", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/loop_counter", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/LoopControlInputs/_21"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81XzEvc2ltcGxlX3Jubl80XzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/enter/_16", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/zeros", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/LoopControlInputs/_21"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81XzEvc2ltcGxlX3Jubl80XzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/enter/_14", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/time", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/LoopControlInputs/_21"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81XzEvc2ltcGxlX3Jubl80XzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/enter/_18", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_1", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/LoopControlInputs/_21"], "attr": {"is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81XzEvc2ltcGxlX3Jubl80XzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/enter/_19", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_2", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/LoopControlInputs/_21"], "attr": {"is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81XzEvc2ltcGxlX3Jubl80XzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/enter/_20", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_3", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/LoopControlInputs/_21"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81XzEvc2ltcGxlX3Jubl80XzEvd2hpbGU="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/merge/_23", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/enter/_13", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/next_iteration/_44"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/merge/_27", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/enter/_17", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/next_iteration/_48"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/merge/_25", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/enter/_15", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/next_iteration/_46"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/merge/_22", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/enter/_12", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/next_iteration/_43"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/merge/_26", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/enter/_16", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/next_iteration/_47"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/merge/_24", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/enter/_14", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/next_iteration/_45"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/cond/_10/input_control_node/_49", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/enter/_18", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/enter/_19", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/enter/_20", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/merge/_22", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/merge/_23", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/merge/_24", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/merge/_25", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/merge/_26", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/merge/_27"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/cond/_10/sequential_5_1/simple_rnn_4_1/while/Less_1", "op": "Less", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/merge/_22", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/merge/_23", "^Func/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/cond/_10/input_control_node/_49"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/cond/_10/sequential_5_1/simple_rnn_4_1/while/Less/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/cond/_10/input_control_node/_49"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/cond/_10/sequential_5_1/simple_rnn_4_1/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/merge/_24", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/cond/_10/sequential_5_1/simple_rnn_4_1/while/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/cond/_10/sequential_5_1/simple_rnn_4_1/while/LogicalAnd", "op": "LogicalAnd", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/cond/_10/sequential_5_1/simple_rnn_4_1/while/Less_1", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/cond/_10/sequential_5_1/simple_rnn_4_1/while/Less"]}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/LoopCond/_28", "op": "LoopCond", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/cond/_10/sequential_5_1/simple_rnn_4_1/while/LogicalAnd"]}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/TensorArrayV2_1_switch/_32", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/merge/_25", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/LoopCond/_28"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/loop_counter_switch/_29", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/merge/_22", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/LoopCond/_28"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/TensorArrayUnstack/TensorListFromTensor_switch/_34", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/merge/_27", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/LoopCond/_28"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/time_switch/_31", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/merge/_24", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/LoopCond/_28"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/zeros_switch/_33", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/merge/_26", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/LoopCond/_28"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/Max_switch/_30", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/merge/_23", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/LoopCond/_28"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/exit/_39", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/TensorArrayV2_1_switch/_32"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/exit/_36", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/loop_counter_switch/_29"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/loop_body_control/_35", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/loop_counter_switch/_29:1"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/exit/_41", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/TensorArrayUnstack/TensorListFromTensor_switch/_34"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/exit/_38", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/time_switch/_31"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/exit/_40", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/zeros_switch/_33"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/exit/_37", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/Max_switch/_30"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/exit/_39", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/input_control_node/_60", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/Max_switch/_30", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/TensorArrayUnstack/TensorListFromTensor_switch/_34", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/TensorArrayV2_1_switch/_32", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/time_switch/_31", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/loop_body_control/_35", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/zeros_switch/_33", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/enter/_18", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/enter/_19", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/enter/_20"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/strided_slice_3", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/strided_slice_3/stack", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/strided_slice_3/stack_1", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/strided_slice_3/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/TensorArrayV2Write/TensorListSetItem/index", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/input_control_node/_60"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/add_1/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/input_control_node/_60"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/add/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/input_control_node/_60"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/input_control_node/_60"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/simple_rnn_cell_1/Cast/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/enter/_18", "^Func/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/input_control_node/_60"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "13"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/simple_rnn_cell_1/add/ReadVariableOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/enter/_19", "^Func/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/input_control_node/_60"]}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/simple_rnn_cell_1/Cast_1/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/enter/_20", "^Func/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/input_control_node/_60"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_8_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/strided_slice_3", "StatefulPartitionedCall/sequential_5_1/dense_8_1/Cast/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/loop_counter_switch/_29:1", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/add_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/time_switch/_31:1", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/add/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/TensorArrayUnstack/TensorListFromTensor_switch/_34:1", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/time_switch/_31:1", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/simple_rnn_cell_1/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/zeros_switch/_33:1", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/simple_rnn_cell_1/Cast_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "Func/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/output_control_node/_79", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/simple_rnn_cell_1/Cast/ReadVariableOp", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/simple_rnn_cell_1/Cast_1/ReadVariableOp", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/simple_rnn_cell_1/add/ReadVariableOp"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/simple_rnn_cell_1/Cast/ReadVariableOp", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/simple_rnn_cell_1/Cast_1/ReadVariableOp", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/simple_rnn_cell_1/add/ReadVariableOp"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_8_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_5_1/dense_8_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/simple_rnn_cell_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/simple_rnn_cell_1/Cast/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/next_iteration/_48", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/TensorArrayUnstack/TensorListFromTensor_switch/_34:1", "^Func/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/output_control_node/_79", "^Func/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/input_control_node/_60"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/next_iteration/_44", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/Max_switch/_30:1", "^Func/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/output_control_node/_79", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/NoOp", "^Func/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/input_control_node/_60"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/next_iteration/_43", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/add_1", "^Func/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/output_control_node/_79", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/next_iteration/_45", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/add", "^Func/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/output_control_node/_79", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_9_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_5_1/dense_8_1/Relu", "StatefulPartitionedCall/sequential_5_1/dense_9_1/Cast/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "grad_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/simple_rnn_cell_1/add_1", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/simple_rnn_cell_1/MatMul", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/simple_rnn_cell_1/MatMul_1", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/simple_rnn_cell_1/add/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_9_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_5_1/dense_9_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/simple_rnn_cell_1/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/simple_rnn_cell_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_5_1/dense_9_1/Sigmoid", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/exit/_41", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/exit/_40", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/exit/_38", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/exit/_39", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/exit/_36", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/exit/_37"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/TensorArrayV2_1_switch/_32:1", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/TensorArrayV2Write/TensorListSetItem/index", "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/simple_rnn_cell_1/Tanh"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "resize_if_index_out_of_bounds": {"b": false}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/next_iteration/_47", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/simple_rnn_cell_1/Tanh", "^Func/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/output_control_node/_79", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/next_iteration/_46", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/TensorArrayV2Write/TensorListSetItem", "^Func/StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/output_control_node/_79", "^StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/NoOp"], "attr": {"T": {"type": "DT_VARIANT"}}}], "library": {}, "versions": {"producer": 1882}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/TensorArrayV2Stack/TensorListStack/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/strided_slice_3/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/strided_slice_3/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/strided_slice_3/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_8_1/Cast/ReadVariableOp", "shape": [128, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_9_1/Cast/ReadVariableOp", "shape": [64, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/Max", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/loop_counter", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/time", "shape": [], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_1", "shape": [13, 128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_2", "shape": [128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_3", "shape": [128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/zeros/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/zeros/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/transpose/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/TensorArrayV2_1/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/TensorArrayV2_1/num_elements", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/cond/_10/sequential_5_1/simple_rnn_4_1/while/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/TensorArrayV2Write/TensorListSetItem/index", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/add_1/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/add/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/TensorArrayV2Read/TensorListGetItem/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/simple_rnn_cell_1/Cast/ReadVariableOp", "shape": [13, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5_1/simple_rnn_4_1/while/body/_11/sequential_5_1/simple_rnn_4_1/while/simple_rnn_cell_1/Cast_1/ReadVariableOp", "shape": [128, 128], "dtype": "float32"}]}]}